app/controllers/admin/coupons_controller.rb

  def index
    @coupons = Coupon.all
---
SELECT `coupons`.* FROM `coupons`

  def edit
    @coupon = Coupon.find(params[:id])
---
SELECT  `coupons`.* FROM `coupons`  WHERE `coupons`.`id` = 4 LIMIT 1

  def update
    reformat_date_order!
    @coupon = Coupon.find(params[:id])
    if @coupon.update_attributes(coupon_params)
---
SELECT  `coupons`.* FROM `coupons`  WHERE `coupons`.`id` = 4 LIMIT 1
UPDATE `coupons` SET `site_wide` = 1, `updated_at` = '2014-06-20 15:37:46' WHERE `coupons`.`type` IN ('FlatCoupon') AND `coupons`.`id` = 4