app/views/checkouts/billing.html.erb

	<%= f.label :shipping_address_state_id, "State" %>
	<%= f.collection_select :shipping_address_state_id, State.all, :id, :short_name %>
---
SELECT `states`.* FROM `states`

<%= form_tag submit_order_checkout_path, remote: true do %>
<%= hidden_field_tag "credit_card[order_id]", @payment_info.order.id %>
<% @payment_info.user.cart.cart_items.each do |cart_item| %>
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 25 LIMIT 1
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`user_id` = 1 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `cart_items`.* FROM `cart_items`  WHERE `cart_items`.`cart_id` = 1

		Product Name: <%= cart_item.variant.product.name %>
		Size: <%= cart_item.variant.size.name %>
---
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 2  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 151 LIMIT 1