app/controllers/checkouts_controller.rb

SELECT  `coupons`.* FROM `coupons`  WHERE (DATE(start_date) <= '2014-06-20' AND DATE(end_date) >= '2014-06-20') AND `coupons`.`site_wide` = 1  ORDER BY `coupons`.`id` DESC LIMIT 1
---
  def billing
    @order = current_or_guest_user.last_incomplete_order
    @site_wide_coupon = Coupon.active.site_wide.last